; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v5)
		(pred_5 ?v6)
		(pred_1 ?v1)
		(pred_4 ?v1)
		(pred_2 ?v6 ?v1)
		(pred_3)
		(pred_6 ?v6))

   (:action op_3
       :parameters  (?v2 ?v3)
       :precondition (and (not-eq ?v2 ?v3) 
                          (pred_1 ?v2) (pred_1 ?v3) (pred_4 ?v2))
       :effect (and  (pred_4 ?v3)
		     (not (pred_4 ?v2))))


   (:action op_2
       :parameters (?v8 ?v7)
       :precondition  (and  (pred_5 ?v8) (pred_1 ?v7)
			    (pred_2 ?v8 ?v7) (pred_4 ?v7) (pred_3))
       :effect (and (pred_6 ?v8)
		    (not (pred_2 ?v8 ?v7)) 
		    (not (pred_3))))

   (:action op_1
       :parameters  (?v8  ?v7)
       :precondition  (and  (pred_5 ?v8) (pred_1 ?v7)
			    (pred_6 ?v8) (pred_4 ?v7))
       :effect (and (pred_2 ?v8 ?v7)
		    (pred_3)
		    (not (pred_6 ?v8)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects obj_03 obj_04 obj_01 
          obj_05 obj_02 
)
(:init
(pred_1 obj_03)
(pred_1 obj_04)
(pred_1 obj_01)
(pred_5 obj_05)
(pred_5 obj_02)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_04 obj_01)
(not-eq obj_01 obj_04)
(pred_3)
(pred_2 obj_05 obj_04)
(pred_2 obj_02 obj_04)
(pred_4 obj_04)
)
(:goal
(and
(pred_2 obj_05 obj_01)
(pred_2 obj_02 obj_04)
)
)

(:constraints
  (sometime-before  (pred_2 obj_05 obj_01) (pred_4 obj_03))
)
)

; plan
1. (op_2 obj_02 obj_04)
   deleted: (pred_2 obj_02 obj_04) (pred_3)
   added: (pred_6 obj_02)
   goals met: 0 of 2
2. (op_3 obj_04 obj_03)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_03)
   goals met: 0 of 2
3. (op_1 obj_02 obj_03)
   deleted: (pred_6 obj_02)
   added: (pred_2 obj_02 obj_03) (pred_3)
   goals met: 0 of 2
4. (op_3 obj_03 obj_04)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_04)
   goals met: 0 of 2
5. (op_2 obj_05 obj_04)
   deleted: (pred_2 obj_05 obj_04) (pred_3)
   added: (pred_6 obj_05)
   goals met: 0 of 2
6. (op_3 obj_04 obj_01)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_01)
   goals met: 0 of 2
7. (op_1 obj_05 obj_01)
   deleted: (pred_6 obj_05)
   added: (pred_2 obj_05 obj_01) (pred_3)
   goals met: 1 of 2
8. (op_3 obj_01 obj_03)
   deleted: (pred_4 obj_01)
   added: (pred_4 obj_03)
   goals met: 1 of 2
9. (op_2 obj_02 obj_03)
   deleted: (pred_2 obj_02 obj_03) (pred_3)
   added: (pred_6 obj_02)
   goals met: 1 of 2
10. (op_3 obj_03 obj_04)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_04)
   goals met: 1 of 2
11. (op_1 obj_02 obj_04)
   deleted: (pred_6 obj_02)
   added: (pred_2 obj_02 obj_04) (pred_3)
   goals met: 2 of 2
